# IsDeterminedByFormula Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameter..::..IsDeterminedByFormula Property
FamilyParameter Class See Also
---
Indicates if the parameter is determined by formula.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsDeterminedByFormula { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsDeterminedByFormula As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsDeterminedByFormula {
	bool get ();
}
```

# Remarks
The parameter is read only if it is determined by formula.
# See Also
FamilyParameter Class
Autodesk.Revit.DB Namespace